---
kind: method
id: M:Autodesk.Revit.DB.ElementArray.ForwardIterator
source: html/62b1fae6-7763-674b-b012-85de805bf8d2.htm
---
# Autodesk.Revit.DB.ElementArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ElementArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.